<?php

namespace App;

class Constants {
    const PAYMENT_INTEREST = 1;
    const PAYMENT_PRINCIPAL = 2;
    const LOAN_STATUS_OPEN = 1;
    const LOAN_STATUS_CLOSED = 2;

    const NUMBERS = [
        1 => 'як',
        2=>'ду',
        3=>'се',
        4=>'чор',
        5=>'панҷ',
        6=>'шаш',
        7=>'ҳафт',
        8=>'ҳашт',
        9=>'нуҳ'];

    const TENTH = [
        1 => 'даҳ',
        2=>'бист',
        3=>'си',
        4=>'чил',
        5=>'панҷоҳ',
        6=>'шаст',
        7=>'ҳафтод',
        8=>'ҳаштод',
        9=>'навад'];

    const COLORS = [
        1 => 'Белый', 2 => 'Черный', 3 => 'Мокрый асфальт', 4 => 'Серебристый', 5 => 'Красный', 6 => 'Зеленый', 7 => 'Синий'
    ];

    const TRANSMISSION = [
        1 => 'Автомат', 2 => 'Механика', 3 => 'Вариатор', 4 => 'Другое'
    ];

    const GAS = [
        1 => 'Бензин', 2 => 'Дизель', 3 => 'Газ', 4 => 'Другое'
    ];
}
